{"basics":{"name":"Mujeeb Qadiri","label":"Bioinformatics Scientist","image":"","email":"qadirimujeeb7@gmail.com","url":"https://mujeebqadiri.github.io","summary":"A San Diego-born bioinformatician with proficiency in genetics, transcriptomics, and metabolomics/lipidomics data analysis.","location":{"postalCode":"CA 92130","city":"San Diego","countryCode":"US","region":"California"},},"work":[{"name":"Perrimon Lab, Department of Genetics, Harvard Medical School","position":"Bioinformatics Scientist","url":"https://perrimon.med.harvard.edu","startDate":"2024-01-01","endDate":"2025-09-30","summary":"Collaborated closely with biologists and informaticians in a fast-paced genomics research environment. Developed and optimized data analysis pipelines for large-scale datasets, including single-cell RNA-seq. Provided computational support from raw data processing to downstream biological interpretation. Designed and maintained bioinformatics tools for public use, regularly presented progress to the team, and contributed to manuscript preparation.","highlights":["single-cell RNA sequencing","bulk RNA sequencing","metabolomics/lipidomics"]}],"education":[{"institution":"Northeastern University","location":"Boston, Massachusetts","url":"https://www.northeastern.edu","area":"Bioinformatics","studyType":"MSc","startDate":"2022-09-01","endDate":"2024-04-01"},{"institution":"University of California, San Diego","location":"San Diego, California","url":"https://ucsd.edu","area":"Biochemistry","studyType":"BS","startDate":"2016-09-01","endDate":"2020-06-01"}],"certificates":[{"name":"Machine Learning","date":"2018-01-01","issuer":"Stanford University","url":"https://www.coursera.org/learn/machine-learning","icon":"fa-solid fa-tag"}],"publications":[{"name":"FlyPhoneDB2: A Computational Framework for Analyzing Cell-Cell Communication in Drosophila scRNA-seq Data Integrating AlphaFold-Multimer Predictions","publisher":"Computational and Structural Biotechnology Journal","releaseDate":"2025-06-20","url":"https://www.csbj.org/article/S2001-0370(25)00248-X/fulltext","summary":"Here we present a major update to FlyPhoneDB, which is used to infer cell-cell communication in drosophila single-cell RNA-sequencing data."},{"name":"Hepatic gluconeogenesis and PDK3 upregulation drive cancer cachexia in flies and mice","publisher":"Nature Metabolism","releaseDate":"2025-04-16","url":"https://www.nature.com/articles/s42255-025-01265-2","summary":"Here we show that a longitudinal full-body single-nuclei-resolution transcriptome analysis in a Drosophila model of cancer cachexia captures interorgan dysregulations. Our study reveals that the tumour-secreted interleukin-like cytokine Upd3 induces fat-body expression of Pepck1 and Pdk, key regulators of gluconeogenesis, disrupting glucose metabolism and contributing to cachexia."},{"name":"Higher resolution pooled genome-wide CRISPR knockout screening in Drosophila cells using integration and anti-CRISPR (IntAC)","publisher":"Nature Communications","releaseDate":"2025-06-15","url":"https://www.nature.com/articles/s41467-025-61692-3","summary":"IntAC represents a straightforward enhancement to existing Drosophila CRISPR screening methods, dramatically increasing accuracy, and might also be broadly applicable to virus-free CRISPR screens in other cell and species types."},{"name":"TF2TG: an online resource mining the potential gene targets of transcription factors in Drosophila","publisher":"Genetics","releaseDate":"2025-05-02","url":"https://academic.oup.com/genetics/advance-article/doi/10.1093/genetics/iyaf082/8123800?login=false","summary":"Here, we developed TF2TG, a resource for researchers to identify potential relationships between TFs and their downstream target genes."},{"name":"FlyRNAi.org 2025 update-expanded resources for new technologies and species","publisher":"Nucleic Acids Research","releaseDate":"2024-10-22","url":"https://academic.oup.com/nar/article/53/D1/D958/7831080?login=false","summary":"Our suite of online resources supports various stages of functional genomics studies for Drosophila and other arthropods, and facilitate a wide range of reagent design, analysis, data mining and analysis approaches by biologists and biomedical experts studying Drosophila, other common genetic model species, arthropod vectors and/or human biology."},{"name":"The epigenetic factor Zrf1 regulates intestinal stem cell proliferation during midgut regeneration","publisher":"PLoS genetics","releaseDate":"2025-10-27","url":"https://journals.plos.org/plosgenetics/article?id=10.1371/journal.pgen.1011910","summary":"Our findings suggest that Zrf1 is potentially a key chromatin regulator necessary for maintaining stem cell proliferation, enhancing our understanding of the molecular controls underlying stem cell function and chromatin-associated defects."},{"name":"In-situ glial cell-surface proteomics identifies pro-longevity factors in Drosophila","publisher":"bioRxiv (pre-print)","releaseDate":"2025-09-26","url":"https://www.biorxiv.org/content/10.1101/2025.09.26.678810v1.abstract","summary":"We investigated how glial cell-surface proteomes change during aging. We identified candidate genes predicted to be involved in brain aging, including several associated with neural development and synapse wiring molecules not previously thought to be particularly active in glia. Through a functional genetic screen, we identified one surface protein, DIP-β, which is down-regulated in old flies and can increase fly lifespan when overexpressed in adult glial cells."},{"name":"Renal Coenzyme A (CoA) Production Fuels Stem Cell Proliferation and Tumor Growth","publisher":"bioRxiv (pre-print)","releaseDate":"2025-08-11","url":"https://www.biorxiv.org/content/10.1101/2025.08.08.669325v1.abstract","summary":"Our findings establish that Myc-driven CoA metabolism generates an inter-organ signal that couples VB5 availability to stem cell control and tumor growth, and identify the CoA-isoprenoid axis as a targetable metabolic vulnerability in cancer."},{"name":"Protein folding stress transcriptionally reprograms muscle metabolism","publisher":"bioRxiv (pre-print)","releaseDate":"2025-10-11","url":"https://www.biorxiv.org/content/10.1101/2025.06.20.660805v1","summary":"We propose that specific gene regulatory networks antagonize each other downstream of unfolded protein repsponse to reprogram muscle metabolism away from carbohydrates and towards lipogenesis, offering novel insight into how metabolic rewiring can be transcriptionally controlled in response to chronic tissue damage, even to the detriment of organ function."},{"name":"Cholinergic Signaling Modulates Intestinal Pathophysiology in a Drosophila Model of Cystic Fibrosis","publisher":"bioRxiv (pre-print)","releaseDate":"2025-07-05","url":"https://www.biorxiv.org/content/10.1101/2025.07.02.662792v1","summary":"This study establishes the Drosophila gut as a powerful model to investigate CF pathogenesis, genetic modifiers, and identifies Ace and Fkh as genetic modifiers. This work also suggests that enhancing cholinergic signaling may represent a viable therapeutic strategy for gastrointestinal manifestations of CF."},],"skills":[{"name":"Programming","level":"Master","icon":"fa-solid fa-hashtag","keywords":["R (Programming Language)","Python","Bash","Git","Nextflow","Docker","SLURM"]}{"name":"Bioinformatic Data Analysis","level":"Master","icon":"fa-solid fa-hashtag","keywords":["Genetics","Transcriptomics","Metabolomics/Lipidomics"]}],"languages":[{"language":"English","fluency":"Native speaker","icon":""},{"language":"Farsi","fluency":"Fluent","icon":""}],"projects":[{"name":"Cell Instance Segmentation","summary":"Use phase contrast microscopy images to train and test a model for instance segmentation of neuronal cells.","highlights":["Machine Learning","Image Segmentation","Classification"],"startDate":"2025-11-01","endDate":"2025-12-30","url":"NULL"}]}